In [1]:
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
#Load in title_basics

title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror

In [3]:
#Load in title_ratings
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1990
1  tt0000002            5.8       265
2  tt0000005            6.2      2654
3  tt0000006            5.0       182
4  tt0000007            5.4       830

In [4]:
#Load in tmdb_data_2000 movies

df_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
df_2000.head()

,Unnamed: 0,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.113,2300.0,PG

In [5]:
#Load in final_tmdb_data_2001
df_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
df_2001.head()

,Unnamed: 0,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.331,1219.0,PG-13
2,2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG
4,4,tt0118154,0.0,NaN,NaN,0.0,"[{'id': 99, 'name': 'Documentary'}]",NaN,292980.0,en,...,0.0,90.0,"[{'english_name': 'Amharic', 'iso_639_1': 'am'...",Released,NaN,White Hotel,0.0,0.000,0.0,NaN

In [6]:
#Concatenate into one dataframe
tmdb_df = pd.concat((df_2000, df_2001))
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2983 entries, 0 to 1542
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             2983 non-null   int64
 1   imdb_id                2983 non-null   object
 2   adult                  2981 non-null   float64
 3   backdrop_path          1522 non-null   object
 4   belongs_to_collection  215 non-null    object
 5   budget                 2981 non-null   float64
 6   genres                 2981 non-null   object
 7   homepage               223 non-null    object
 8   id                     2981 non-null   float64
 9   original_language      2981 non-null   object
 10  original_title         2981 non-null   object
 11  overview               2930 non-null   object
 12  popularity             2981 non-null   float64
 13  poster_path            2635 non-null   object
 14  production_companies   2981 non-null   object
 15  production_countries   2981 non-null   object
 16  release_date           2941 non-null   object
 17  revenue                2981 non-null   float64
 18  runtime                2981 non-null   float64
 19  spoken_languages       2981 non-null   object
 20  status                 2981 non-null   object
 21  tagline                1188 non-null   object
 22  title                  2981 non-null   object
 23  video                  2981 non-null   float64
 24  vote_average           2981 non-null   float64
 25  vote_count             2981 non-null   float64
 26  certification          867 non-null    object
dtypes: float64(9), int64(1), object(17)
memory usage: 652.5+ KB

In [7]:
username = "root"
password = "root"
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)

In [8]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

# Title_basics

In [9]:
#Drop columns from tmbd_data
title_basics = title_basics.drop(columns = ['titleType','originalTitle','isAdult',"endYear"])
#Verify the drop
title_basics.value_counts()

tconst      primaryTitle                startYear  runtimeMinutes  genres
tt0035423   Kate & Leopold              2001.0     118             Comedy,Fantasy,Romance    1
tt3581704   The Exchange                2016.0     79              Drama,Romance             1
tt3582948   From Tehran to Heaven       2013.0     75              Drama,Mystery             1
tt3582890   Painting the Place Between  2013.0     56              Biography,Documentary     1
tt3582678   Miss Change                 2013.0     91              Comedy,Romance            1
                                                                                            ..
tt1433527   Jack Squad                  2009.0     128             Comedy,Drama              1
tt1433524   Heavenly Touch              2009.0     90              Drama,Romance             1
tt1433514   A Boy Called Dad            2009.0     80              Drama                     1
tt14335096  A Floating World            2020.0     56              Documentary               1
tt9916362   Coven                       2020.0     92              Drama,History             1
Name: count, Length: 114611, dtype: int64

In [10]:
## create a col with a list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0068865,Lives of Performers,2016.0,90,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
4,tt0082328,Embodiment of Evil,2008.0,94,Horror,[Horror]
...,...,...,...,...,...,...
114607,tt9915436,Vida em Movimento,2019.0,70,Documentary,[Documentary]
114608,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
114609,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
114610,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
114611,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [11]:
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0068865,Lives of Performers,2016.0,90,Drama,Drama
...,...,...,...,...,...,...
114610,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
114610,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
114610,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
114611,tt9916362,Coven,2020.0,92,"Drama,History",Drama
114611,tt9916362,Coven,2020.0,92,"Drama,History",History

In [12]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [13]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [14]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Documentary': 7,
 'Drama': 8,
 'Family': 9,
 'Fantasy': 10,
 'Game-Show': 11,
 'History': 12,
 'Horror': 13,
 'Music': 14,
 'Musical': 15,
 'Mystery': 16,
 'News': 17,
 'Reality-TV': 18,
 'Romance': 19,
 'Sci-Fi': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
#Make new integer column in title_genres table
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423        10
0  tt0035423        19
1  tt0062336         8
2  tt0068865         8

In [16]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                      'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [17]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [18]:
# Convert genres and genres_split columns to strings
title_basics['genres'] = title_basics['genres'].astype(str)
title_basics['genres_split'] = title_basics['genres_split'].astype(str)

In [19]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine, index=False, if_exists = 'replace')

114612

In [20]:
#Add tconst as primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`(255));')

In [21]:
#Checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0     title_basics
1    title_ratings

In [22]:
q= '''SELECT * FROM title_basics'''
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","['Comedy', 'Fantasy', 'Romance']"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,['Drama']
2,tt0068865,Lives of Performers,2016.0,90,Drama,['Drama']
3,tt0069049,The Other Side of the Wind,2018.0,122,Drama,['Drama']
4,tt0082328,Embodiment of Evil,2008.0,94,Horror,['Horror']
...,...,...,...,...,...,...
114607,tt9915436,Vida em Movimento,2019.0,70,Documentary,['Documentary']
114608,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","['Comedy', 'Drama', 'Fantasy']"
114609,tt9916170,The Rehearsal,2019.0,51,Drama,['Drama']
114610,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","['Action', 'Adventure', 'Thriller']"
114611,tt9916362,Coven,2020.0,92,"Drama,History","['Drama', 'History']"

In [23]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_ratings_schema = {
     "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [24]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine, index=False, if_exists = 'replace')

507135

In [25]:
#Checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0     title_basics
1    title_ratings

In [26]:
q= '''SELECT * FROM title_ratings'''
pd.read_sql(q,engine)

           tconst  averageRating  numVotes
0       tt0000001            5.7      1990
1       tt0000002            5.8       265
2       tt0000005            6.2      2654
3       tt0000006            5.0       182
4       tt0000007            5.4       830
...           ...            ...       ...
507130  tt9916200            8.1       233
507131  tt9916204            8.1       267
507132  tt9916348            8.3        18
507133  tt9916362            6.4      5501
507134  tt9916428            3.6        16

[507135 rows x 3 columns]

In [27]:
#Add tconst as primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`(255));')

In [29]:
#Concatenate TMDB files into one dataframe
tmdb_data = pd.concat((df_2000, df_2001))
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2983 entries, 0 to 1542
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             2983 non-null   int64
 1   imdb_id                2983 non-null   object
 2   adult                  2981 non-null   float64
 3   backdrop_path          1522 non-null   object
 4   belongs_to_collection  215 non-null    object
 5   budget                 2981 non-null   float64
 6   genres                 2981 non-null   object
 7   homepage               223 non-null    object
 8   id                     2981 non-null   float64
 9   original_language      2981 non-null   object
 10  original_title         2981 non-null   object
 11  overview               2930 non-null   object
 12  popularity             2981 non-null   float64
 13  poster_path            2635 non-null   object
 14  production_companies   2981 non-null   object
 15  production_countries   2981 non-null   object
 16  release_date           2941 non-null   object
 17  revenue                2981 non-null   float64
 18  runtime                2981 non-null   float64
 19  spoken_languages       2981 non-null   object
 20  status                 2981 non-null   object
 21  tagline                1188 non-null   object
 22  title                  2981 non-null   object
 23  video                  2981 non-null   float64
 24  vote_average           2981 non-null   float64
 25  vote_count             2981 non-null   float64
 26  certification          867 non-null    object
dtypes: float64(9), int64(1), object(17)
memory usage: 652.5+ KB

In [31]:
#Drop columns from tmbd_data
tmdb_data = tmdb_data.drop(columns = ['adult', 'backdrop_path', 
                                      'belongs_to_collection', 'genres', 
                                      'homepage', 'id', 'original_language', 
                                      'original_title', 'overview', 'popularity', 
                                      'poster_path', 'production_companies', 
                                      'production_countries', 'release_date', 
                                      'runtime', 'spoken_languages', 'status', 
                                      'tagline', 'title', 'video', 'vote_average', 
                                      'vote_count'])

In [41]:
#Drop first row
tmdb_data = tmdb_data.drop([0])
tmdb_data.head()

   Unnamed: 0    imdb_id      budget     revenue certification
1           1  tt0113026  10000000.0         0.0           NaN
2           2  tt0113092         0.0         0.0           NaN
3           3  tt0116391         0.0         0.0           NaN
4           4  tt0118694    150000.0  14204632.0            PG
5           5  tt0118852         0.0         0.0             R

In [42]:
#Calculate max string lengths for object columns
id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(id_len+1),
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}

In [43]:
#Save tmdb_data to sql
tmdb_data.to_sql('tmdb_data', engine, dtype = tmdb_schema, 
                    if_exists = 'replace', index = False)

2981

In [44]:
#Checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0     title_basics
1    title_ratings
2        tmdb_data

In [45]:
#Add imdb_id as primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [46]:
#Query to run first five rows of title_basics table
q = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q, engine)

   Unnamed: 0    imdb_id      budget     revenue certification
0           1  tt0035423  48000000.0  76019000.0         PG-13
1           1  tt0113026  10000000.0         0.0          None
2           2  tt0113092         0.0         0.0          None
3           2  tt0114447         0.0         0.0          None
4           3  tt0116391         0.0         0.0          None

# Title_genres

In [47]:
#Save title_genres to sql
title_genres.to_sql('title_genres', engine, if_exists = 'replace')

205008

In [49]:
#Checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0     title_basics
1     title_genres
2    title_ratings
3        tmdb_data

In [48]:
#Query to run first five rows of title_basics table
q = """
SELECT *
FROM title_genres
LIMIT 5;
"""
pd.read_sql(q, engine)

   index     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423        10
2      0  tt0035423        19
3      1  tt0062336         8
4      2  tt0068865         8

# Genres

In [51]:
#Save genre_lookup to sql
genre_lookup.set_index('Genre_ID').to_sql('genres', engine, if_exists = 'replace', index=True)

26

In [52]:
#Query to run first five rows of title_basics table
q = """
SELECT *
FROM genres
LIMIT 5;
"""
pd.read_sql(q, engine)

   Genre_ID Genre_Name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography